/*
    🔹 ABS - функция, возвращает абсолютное (положительное) значение указанного числа;
    🔹 ROUND - округленное
    🔹 CEILING - округление до целого в большую сторону
    🔹 FLOOR - округление до целого в меньшую сторону
    🔹 SQRT - квадратный корень
    🔹 SQUARE - квадрат
    🔹 POWER - степень
    🔹 LOG - логарифм 
    🔹 TAN - тангенс
    🔹 COT - косинус
    🔹 COS - котангенс
*/
-----------------------------------------------------------------

SELECT ABS(-100) AS [ABS],
       ROUND(1.538398, 2) AS [ROUND],
       CEILING(1.1) AS [CEILING],
       FLOOR(2.9) AS [FLOOR],
       SQRT(16) AS [SQRT],
       SQUARE(4) AS [SQUARE],
       POWER(4, 2) AS [POWER],
       LOG(10) AS [LOG]
